package main

import "fmt"

func testLacks() {
	lacks := [...]string{
		" +  К 03.09.16 -",
		" -  П 08.01.16 +  К 25.07.16 -",
		" +  К 22.05.18 -  П 31.05.18 +  К 11.07.18 -  П 03.09.18 +",
		" +  13.07.18 пер(Товар НЕДОСТАЧА В УПАКОВКАХ) -  П 19.07.18 +",
		" + ",
		" +  13.07.18 пер(Товар НЕДОСТАЧА В УПАКОВКАХ) -  П 19.07.18 +",
		" +  22.05.18 пер(Товар НЕДОСТАЧА В УПАКОВКАХ) -  П 11.07.18 +  К 08.10.18 -  П 05.12.18 +",
		" +  К 30.07.18 -",
		" +  01.01.18 пер(ХИМИЯ переделка) -  П 20.02.18 +  К 16.05.18 -  П 15.06.18 +  К 14.08.18 -  П 07.09.18 +",
		" +  30.03.18 пер(ХИМИЯ переделка) -",
		" -  П 29.10.18 + ",
		" Новый товар ",
	}

	for _, v := range lacks {
		fmt.Printf("'%s': %v\n", v, parseLackRange(v))
	}
}

func main() {
	testLacks()

	serveui("./frontend/dist")
}
